{
    "en": [
        {
            "title": "What is online accounting?",
            "text": "It is a beneficial solution for busy individuals who don't have to waste time on commuting and can instead focus on running their own business. Our office, BEEP, offers remote service through phone and internet. Additionally, we provide a professional accounting software that archives all invoices and expense documents, handles VAT calculations, and manages the Payroll system. Both the client and our accountant have access to the software, allowing for real-time monitoring, document completion, and tax filing."
        },
        {
            "title": "What is Making Tax Digital for VAT-registered businesses?",
            "text": "Starting from 1st April 2019, VAT-registered businesses (with a turnover above £85,000) are required to submit digital tax returns. In practice, this means that all VAT-related data must be collected and sent to HMRC using specific software. Our accounting office, BEEP, offers assistance in digital accounting, including business management and data archiving in compatible software like QuickBooks. Additionally, we provide a discount to our clients for purchasing a monthly subscription of the software."
        },
        {
            "title": "How much does it cost to run a sole proprietorship?",
            "text": "A sole proprietorship is only taxed once a year (Self Assessment). The cost of the tax return starts from £120."
        },
        {
            "title": "I want to start an LTD company. How long does it take?",
            "text": "An LTD company is registered with the Company House. Within 48 hours, the director receives a document confirming the establishment of the LTD company, enabling them to open a business account in any bank in the UK."
        },
        {
            "title": "Is it necessary to schedule consultations regarding accounting or insurance?",
            "text": "We ask our clients to schedule appointments by phone. Due to a high number of clients, we may be unavailable when a client arrives without prior notice. A pre-arranged appointment ensures that the meeting takes place and is handled by the appropriate expert."
        },
        {
            "title": "What are the available payment methods?",
            "text": "Payments can be made via bank transfer to our bank account or in cash at our office. / BEEP – Financial Advice Service / Bank: HSBC / Sort code: 40-08-32 / Account: 32251973"
        },
        {
            "title": "Is parking available in front of the office?",
            "text": "There is free parking available for our clients in front of the building where BEEP office is located."
        }
    ],
    "pl": [
        {
            "title": "Czym jest księgowośc online?",
            "text": "To korzystne rozwiązanie dla osób zapracowanych, które nie muszą tracić czasu na dojazdy, a zamiast tego mogą skupić się na prowadzeniu własnej działalności. Nasze biuro BEEP oferuję obsługę przez telefon i internet. Dodatkowo zapewniamy profesjonalny program do prowadzenia księgowości, w którym archiwizowane są wszystkie faktury i dokumenty kosztowe, oraz rozliczany jest VAT i prowadzony system wypłat Payroll. Do programu dostęp ma zarówno klient, jak i nasz księgowy, który na bieżąco kontroluje i uzupełnia dokumenty kosztowe, oraz robi wszelkie rozliczenia podatkowe."
        },
        {
            "title": "Co to jest Making Tax Digital dla firm zarejestrowanych na VAT?",
            "text": "Od 1 kwietnia 2019 przedsiębiorcy zarejestrowani na VAT (z obrotem powyżej £85 000) będą zobowiązani do składania cyfrowego rozliczenia podatkowego. W praktyce oznacza to, że wszystkie dane dotyczące rozliczenia VAT będą musiały być zgromadzone i wysyłane do HMRC poprzez specjalne oprogramowanie. Nasze biuro księgowe BEEP oferuje pomoc w prowadzeniu księgowości cyfrowej, czyli prowadzeniu firmy i archiwizację danych w kompatybilnym programie QuickBooks. Dodatkowo oferujemy naszym klientom zniżkę na zakup miesięcznej subskrybcji w tymże oprogramowaniu."
        },
        {
            "title": "Ile kosztuje prowadzenie działalności jednoosobowej?",
            "text": "Spółkę jednoosobową rozlicza się tylko raz w roku (Self Assessment). Koszt samego rozliczenia zaczyna się od £120."
        },
        {
            "title": "Chcę założyć firmę LTD. Jak długo to trwa?",
            "text": "Spółkę LTD rejestruje się w Company House (Rejestr firm). W ciągu 48hr dyrektor otrzymuje dokument potwierdzający założenie firmy LTD, który umożliwia otworzenie konta biznesowego w dowolnym banku na terenie Wielkiej Brytanii."
        },
        {
            "title": "Czy konieczne jest umawianie się na konsultacje dotyczące księgowości lub ubezpieczenia?",
            "text": "Prosimy naszych klientów o telefoniczne umawianie się na spotkanie. Z uwagi na dużą liczbę klientów, możemy być niedostępniw chwili, gdy klient przychodzi niezapowiedziany. Umówiona wcześniej wizyta jest gwarancją, że spotkanie się odbędzie, a sprawę poprowadzi odpowiedni ekspert."
        },
        {
            "title": "Jak w jaki sposób można dokonać płatności?",
            "text": "Płatności można dokonać przelewem na nasze konto bankowe lub gotówką w biurze. / BEEP – Financial Advice Service / Bank HSBC / Sort code: 40-08-32 / Account: 32251973"
        },
        {
            "title": "Czy przed biurem jest dostępny parking?",
            "text": "Przed budynkiem, w którym mieści się biuro BEEP, jest bezpłatny parking dla naszych klientów.."
        }
    ]
}